# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'

# Binaries
brew 'ant' # Apache Ant
brew 'go' # GO programming language
brew 'jq' # JSON processor
brew 'mas' # Mac App Store manager
brew 'maven'
brew 'mercurial'
brew 'neovim'
brew 'python'

# Apps
cask 'adobe-acrobat-reader'
cask 'android-studio'
cask 'apache-directory-studio'
# cask 'atom' # Atom leaves dirty uninstall.
cask 'dashlane'
cask 'dropbox'
cask 'firefox-developer-edition'
cask 'git-lfs'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'gradle'
cask 'groovy'
cask 'jenv'
cask 'jd-gui'
cask 'keystore-explorer'
cask 'kitematic'
cask 'mysqlworkbench'
cask 'netbeans'
cask 'ngrok'
cask 'p4v'
cask 'postman'
cask 'pycharm-ce'
# cask 'skype-for-business'
cask 'slack'
cask 'sourcetree'
cask 'sync'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visualvm'
cask 'visual-studio-code'
cask 'vmware-fusion'
cask 'zoom'
cask 'zulu8'  # Java 8
cask 'zulu11' # Java 11

# Mac App Store
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'OneDrive', id: 823766827
# mas 'Photos Duplicate Cleaner', id: 592704001
mas 'Server', id: 883878097
mas 'The Unarchiver', id: 425424353
