# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'

# Binaries
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'maven'
brew 'neovim'

# Apps
cask 'adobe-acrobat-reader'
cask 'apache-directory-studio'
cask 'atom'
cask 'dashlane'
cask 'dropbox'
cask 'firefox-developer-edition'
cask 'flash-npapi' # Adobe Flash Player for Safari and Firefox
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'jd-gui'
cask 'kitematic'
cask 'mysqlworkbench'
cask 'netbeans'
cask 'p4v'
cask 'pycharm-ce'
cask 'skype-for-business'
cask 'slack'
cask 'sourcetree'
cask 'sync'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visualvm'
cask 'visual-studio-code'
cask 'vmware-fusion'
cask 'zoomus'

# Mac App Store
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'OneDrive', id: 823766827
# mas 'Photos Duplicate Cleaner', id: 592704001
mas 'Server', id: 883878097
mas 'The Unarchiver', id: 425424353
