# Taps
tap 'cesanta/mos'
tap 'graalvm/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'graalvm/tap'

# Binaries
brew 'ant' # Apache Ant
brew 'awscli' # AWS CLI v. 2.0
brew 'go' # GO programming language
brew 'jq' # JSON processor
brew 'mas' # Mac App Store manager
brew 'maven' # Apache Maven
brew 'mercurial' # Mercurial Source Control System (SCS)
brew 'mos' # Mongoose OS
brew 'neovim' # Neovim Text Editor
brew 'python' # Python Programming Language

# Apps
cask 'adobe-acrobat-reader'
cask 'android-studio'
cask 'apache-directory-studio'
# cask 'atom' # Atom Editor (leaves dirty uninstall)
cask 'dashlane'
cask 'dropbox'
cask 'firefox-developer-edition'
cask 'git-lfs'
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite'
cask 'gradle'
cask 'groovy'
cask 'graalvm-ce-java17'
cask 'jenv'
cask 'jd-gui'
cask 'keystore-explorer'
cask 'kitematic'
cask 'mysqlworkbench'
cask 'netbeans'
cask 'ngrok'
cask 'p4v'
cask 'postman'
cask 'pycharm-ce'
cask 'session-manager-plugin'
cask 'slack'
cask 'sourcetree'
cask 'sync'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visualvm'
cask 'visual-studio-code'
cask 'vmware-fusion'
# cask 'wireshark'
cask 'zoom'
# cask 'zulu8'  # Java 8
# cask 'zulu11' # Java 11

# Mac App Store
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'OneDrive', id: 823766827
# mas 'Photos Duplicate Cleaner', id: 592704001
mas 'Server', id: 883878097
mas 'The Unarchiver', id: 425424353
